In [6]:
from IPython.display import display, HTML 
display(HTML("""
<style>
div.container{width:86% !important;}
div.cell.code_cell.rendered{width:100%;}
div.CodeMirror {font-family:Consolas; font-size:15pt;}
div.output {font-size:15pt; font-weight:bold;}
div.input {font-family:Consolas; font-size:15pt;}
div.prompt {min-width:70px;}
div#toc-wrapper{padding-top:120px;}
div.text_cell_render ul li{font-size:12pt;padding:5px;}
table.dataframe{font-size:15px;}
</style>
"""))

<b><font size="5" color="red">ch11. 데이터프레임(Pandas) </font><b>
    
- pip install pandas / conda install pandas (아나콘다 프롬프트)
# 1절. 판다스 패키지
- 데이터 분석을 위해 반드시 알아야 할 패키지. 넘파이 기반으로 다른 많은 라이브러리와 잘 통합되도록 설계
- 1차원 구조를 갖는 시리즈, 2차원 구조를 갖는 데이터프레임(excel의 스프레드시트)을 제공
- 판다스 장점 : 파일io, 부분 데이터 추출, 크기변경, 데이터 분할, 병합, 정렬, 결측치 처리, 피벗과 업피벗(와이드포맷과 롱포맷)에 용이
- [Pandas API Reference](https://pandas.pydata.org/docs/reference/index.html)
- [Pandas docs](https://pandas.pydata.org/docs/index.html)

In [7]:
import pandas as pd
pd.__version__

'1.5.3'

In [8]:
data = pd.read_csv('data/ch09_member4.csv') # encoding='utf-8'이 기본값
display(data)
type(data)

  name  age    email address
0  홍길동   22  a@a.com     신림동
1  신길동   30  b@a.com     신림동
2  김길동   42  c@a.com     신림동
3  홍길동   22  a@a.com     신림동
4  신길동   30  b@a.com     신림동
5  김길동   42  c@a.com     신림동

pandas.core.frame.DataFrame

In [9]:
data = pd.read_csv('data/ch09_member1.csv', 
                    header=None,
                    names=['name','age','email','address'])
data.head(2) # 최초 상위 2줄

  name  age             email   address
0  홍길동   20  kildong@hong.com   서울시 관악구
1  김길동   40  kimdong@hong.com  서울시 영등포구

In [10]:
data = pd.read_json('data/ch09_member.json') #기본값이 utf-8
data

  Name  Age             Email Address Job
0  홍길동   20  kildong@hong.com      서울
1  김길동   40  kimdong@hong.com      인천  팀장
2  신길동   30  sindong@hong.com      경기

In [11]:
iris = pd.read_hdf('data/ch09_iris.hdf5', key='iris')
iris.head() #상위 5개

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

# 2절. 데이터 프레임 만들기
## 2.1 딕셔너리를 이용해서 데이터 프레임 만들기

In [12]:
d = {'kor':[100,90], 'mat':[95,99]} # 딕셔너리를 데이터프레임으로
df = pd.DataFrame(data=d)
df

   kor  mat
0  100   95
1   90   99

In [13]:
df.to_dict() # 데이터 프레임을 딕셔너리로 변환

{'kor': {0: 100, 1: 90}, 'mat': {0: 95, 1: 99}}

In [14]:
df.to_numpy()

array([[100,  95],
       [ 90,  99]], dtype=int64)

In [15]:
# 딕셔너리 리스트를 데이터프레임
d = [{'kor':100, 'math':95}, {'kor':90., 'math':99}]
df = pd.DataFrame(data=d)
df

     kor  math
0  100.0    95
1   90.0    99

In [16]:
df.dtypes

kor     float64
math      int64
dtype: object

In [17]:
df.info() # ★

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   kor     2 non-null      float64
 1   math    2 non-null      int64
dtypes: float64(1), int64(1)
memory usage: 160.0 bytes

In [18]:
d = [{'kor':100, 'mat':100}, {'kor':90, 'mat':91}, {'kor':93, 'math':100}]
df = pd.DataFrame(data=d) 
#결측치는 실수형(float64). 정수형 변환 불가(결측치 대체를 한 수 정수형 변환)
df

   kor    mat   math
0  100  100.0    NaN
1   90   91.0    NaN
2   93    NaN  100.0

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   kor     3 non-null      int64
 1   mat     2 non-null      float64
 2   math    1 non-null      float64
dtypes: float64(2), int64(1)
memory usage: 200.0 bytes

## 2.2 리스트를 이용해서 데이터 프레임 만들기

In [20]:
title = ['책1', '책2', '책3']
price = [15000, 18000, 10000]
df = pd.DataFrame(data={'title':title, 'price':price})
df

  title  price
0    책1  15000
1    책2  18000
2    책3  10000

In [21]:
import numpy as np
np.c_[title, price]

array([['책1', '15000'],
       ['책2', '18000'],
       ['책3', '10000']], dtype='<U11')

In [22]:
df = pd.DataFrame(np.c_[title,price], columns=['책이름', '가격'])
df

  책이름     가격
0  책1  15000
1  책2  18000
2  책3  10000

In [23]:
l = [['책1',15000],
     ['책2',18000],
     ['책3',10000]]
df = pd.DataFrame(l, columns=['책이름', '가격'])
df

  책이름     가격
0  책1  15000
1  책2  18000
2  책3  10000

## 2.3 read_csv

In [24]:
!dir

 C 드라이브의 볼륨에는 이름이 없습니다.
 볼륨 일련 번호: 3664-591E

 C:\ai_x\source\01_python 디렉터리

2025-04-28  오후 05:07    <DIR>          .
2025-04-28  오후 05:07    <DIR>          ..
2025-04-28  오후 02:29    <DIR>          .ipynb_checkpoints
2025-04-24  오후 02:22            12,476 0424_ch10_dtype을int32에서int64로변경시.xlsx
2025-04-14  오후 12:09             7,506 ch01_파이썬개요및환경설정.ipynb
2025-04-21  오전 09:24            63,536 ch02 자료형과 연산자(1절~4절).ipynb
2025-04-16  오후 04:07            70,630 ch03_데이터구조.ipynb
2025-04-16  오전 10:39               151 ch05.py
2025-04-21  오후 02:46            18,121 ch06_모듈과패키지.ipynb
2025-04-21  오후 03:08            43,862 ch07_객체 지향 프로그래밍.ipynb
2025-04-23  오전 09:48            32,015 ch08_예외처리.ipynb
2025-04-24  오후 12:12    <DIR>          ch09_ex
2025-04-28  오전 10:59           120,324 ch09_파일io(입출력) 프로그래밍.ipynb
2025-04-28  오후 02:11           178,050 ch10_N차원 배열 다루기_1절~3절.ipynb
2025-04-28  오후 02:15           112,147 ch10_N차원배열 다루기 4절~.ipynb
2025-04-28  오후 05:07            87,210 ch11_데이터프레임과 시리즈 (Pandas)_1절~8절.ipynb
2025-04-21  오전 09:34            39,856 ch2 자료형과연산자(5절~).ipynb
2025-04-21  오후 05:35            36,983 ch4. 제어문.ipynb
2025-04-21  오후 03:09           210,473 ch5_함수.ipynb
2025-04-28  오후 04:41    <DIR>          data
2025-04-14  오전 11:50               344 safe_index.py
2025-04-08  오전 11:48                21 test.py
2025-04-09  오후 12:07                15 text.py
2025-04-16  오전 10:37    <DIR>          __pycache__
2025-04-25  오후 03:50            22,575 파이썬 강의 요약
              19개 파일           1,056,295 바이트
               6개 디렉터리  134,781,231,104 바이트 남음

In [25]:
df = pd.read_csv(r'c:/ai_x/download/shareData/상가정보_20250331/소상공인시장진흥공단_상가(상권)정보_세종_202503.csv',
                # encoding='utf-8',
                # sep=',',
                low_memory=False, # 데이터 용량이 클 경우만 기입
                nrows=30,         # 처음 30행만
                )
df.shape

(30, 39)

In [26]:
df.head(1)

,상가업소번호,상호명,지점명,상권업종대분류코드,상권업종대분류명,상권업종중분류코드,상권업종중분류명,상권업종소분류코드,상권업종소분류명,표준산업분류코드,...,건물관리번호,건물명,도로명주소,구우편번호,신우편번호,동정보,층정보,호정보,경도,위도
0,MA010120220700019175,세종수이비인후과의원,NaN,Q1,보건의료,Q102,의원,Q10201,내과/소아과 의원,Q86201,...,3611011600200050002000001,행정중심복합도시,세종특별자치시 세종특별자치시 해밀3로 43,NaN,30092,NaN,NaN,NaN,127.264487,36.528585

In [27]:
# 판단스 디스플레이 옵션
pd.options.display.max_columns = 39 # 기본값:20이나 39열까지 display 가능
pd.options.display.max_rows # 40행까지 display 가능 (기본값 60)
df.head(1)

,상가업소번호,상호명,지점명,상권업종대분류코드,상권업종대분류명,상권업종중분류코드,상권업종중분류명,상권업종소분류코드,상권업종소분류명,표준산업분류코드,표준산업분류명,시도코드,시도명,시군구코드,시군구명,행정동코드,행정동명,법정동코드,법정동명,지번코드,대지구분코드,대지구분명,지번본번지,지번부번지,지번주소,도로명코드,도로명,건물본번지,건물부번지,건물관리번호,건물명,도로명주소,구우편번호,신우편번호,동정보,층정보,호정보,경도,위도
0,MA010120220700019175,세종수이비인후과의원,NaN,Q1,보건의료,Q102,의원,Q10201,내과/소아과 의원,Q86201,일반의원,36,세종특별자치시,36110,세종특별자치시,36110525,해밀동,3611011600,해밀동,3611011600200050002,2,산,5,2.0,세종특별자치시 세종특별자치시 해밀동 산5-2,361103352828,세종특별자치시 세종특별자치시 해밀3로,43,NaN,3611011600200050002000001,행정중심복합도시,세종특별자치시 세종특별자치시 해밀3로 43,NaN,30092,NaN,NaN,NaN,127.264487,36.528585

In [28]:
df.head(3).T

,0,1,2
상가업소번호,MA010120220700019175,MA010120220800005576,MA010120220800006182
상호명,세종수이비인후과의원,우보설렁탕,메이빈
지점명,NaN,NaN,NaN
상권업종대분류코드,Q1,I2,I2
상권업종대분류명,보건의료,음식,음식
상권업종중분류코드,Q102,I201,I212
상권업종중분류명,의원,한식,비알코올
상권업종소분류코드,Q10201,I20102,I21201
상권업종소분류명,내과/소아과 의원,국/탕/찌개류,카페
표준산업분류코드,Q86201,I56111,I56221
표준산업분류명,일반의원,한식 일반 음식점업,커피 전문점
시도코드,36,36,36
시도명,세종특별자치시,세종특별자치시,세종특별자치시
시군구코드,36110,36110,36110
시군구명,세종특별자치시,세종특별자치시,세종특별자치시
행정동코드,36110525,36110250,36110560
행정동명,해밀동,조치원읍,보람동
법정동코드,3611011600,3611025023,3611010300
법정동명,해밀동,조치원읍,보람동
지번코드,3611011600200050002,3611025023100230051,3611010300107050000
대지구분코드,2,1,1
대지구분명,산,대지,대지
지번본번지,5,23,705
지번부번지,2.0,51.0,NaN
지번주소,세종특별자치시 세종특별자치시 해밀동 산5-2,세종특별자치시 세종특별자치시 조치원읍 평리 23-51,세종특별자치시 세종특별자치시 보람동 705
도로명코드,361103352828,361103258043,361102348105
도로명,세종특별자치시 세종특별자치시 해밀3로,세종특별자치시 세종특별자치시 조치원읍 문화로,세종특별자치시 세종특별자치시 시청대로
건물본번지,43,24,127
건물부번지,NaN,NaN,NaN
건물관리번호,3611011600200050002000001,4473025023100230051035586,3611010300106640011000001
건물명,행정중심복합도시,NaN,강남프라자
도로명주소,세종특별자치시 세종특별자치시 해밀3로 43,세종특별자치시 세종특별자치시 조치원읍 문화로 24,세종특별자치시 세종특별자치시 시청대로 127
구우편번호,NaN,339885.0,339008.0
신우편번호,30092,30025,30151
동정보,NaN,NaN,NaN
층정보,NaN,NaN,3.0
호정보,NaN,NaN,NaN
경도,127.264487,127.301068,127.286081
위도,36.528585,36.60377,36.479674

In [38]:
# (1) csv파일 불러오기
member = pd.read_csv('data/ch11_member.csv')
member

   Name  Age          Email  Address       Birth
0   홍길동   20  hong@hong.com  서울시 강동구  1999-01-01
1   홍길서   30   seo@hong.com   서울시 중구  1999-12-01
2   홍길남   21   nam@hong.com  서울시 강동구  1999-11-01
3   홍길북   22   buk@hong.com  서울시 관악구  1999-05-01
4   홍길중   23   mid@hong.com   부산시 중구  1999-01-30
5  #홍길뜽   24    non@not.com      없는구  2000-01-01

In [39]:
member.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     6 non-null      object
 1   Age      6 non-null      int64
 2   Email    6 non-null      object
 3   Address  6 non-null      object
 4   Birth    6 non-null      object
dtypes: int64(1), object(4)
memory usage: 368.0+ bytes

In [40]:
# 형변환 age열:int64 -> int16
member['Age'] = member['Age'].astype(np.int16) # 'int' : np.int32
member.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     6 non-null      object
 1   Age      6 non-null      int16
 2   Email    6 non-null      object
 3   Address  6 non-null      object
 4   Birth    6 non-null      object
dtypes: int16(1), object(4)
memory usage: 332.0+ bytes

In [41]:
# 형변환 Birth열 : object(문자) -> datetime64
member['Birth_as'] = member['Birth'].astype('datetime64')
member.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      6 non-null      object
 1   Age       6 non-null      int16
 2   Email     6 non-null      object
 3   Address   6 non-null      object
 4   Birth     6 non-null      object
 5   Birth_as  6 non-null      datetime64[ns]
dtypes: datetime64[ns](1), int16(1), object(4)
memory usage: 380.0+ bytes

In [42]:
member['Birth_to'] = pd.to_datetime(member['Birth']) # astype()함수보다 안전한 형변환
member.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      6 non-null      object
 1   Age       6 non-null      int16
 2   Email     6 non-null      object
 3   Address   6 non-null      object
 4   Birth     6 non-null      object
 5   Birth_as  6 non-null      datetime64[ns]
 6   Birth_to  6 non-null      datetime64[ns]
dtypes: datetime64[ns](2), int16(1), object(4)
memory usage: 428.0+ bytes

In [43]:
# (2) 특정행 제외하고 csv 파일 읽기
member = pd.read_csv('data/ch11_membercp949.csv',
                    encoding='cp949',
                    skiprows=[1,6]) # 1,6번째 행은 제외하고 읽어오기
member

  Name  Age         Email  Address       Birth
0  홍길서   30  seo@hong.com   서울시 중구  1999-12-01
1  홍길남   21  nam@hong.com  서울시 강동구  1999-11-01
2  홍길북   22  buk@hong.com  서울시 관악구  1999-05-01
3  홍길중   23  mid@hong.com   부산시 중구  1999-01-30

In [45]:
# (3) 주석(#) 제외, datatime형 필드 지정하여 읽기
member = pd.read_csv('data/ch11_membertab.csv', 
                    sep='\t',
                    comment='#',
                    parse_dates=['Birth']) # datetime형으로 읽어올 필드 지정
member

  Name  Age          Email  Address      Birth
0  홍길동   20  hong@hong.com  서울시 강동구 1999-01-01
1  홍길서   30   seo@hong.com   서울시 중구 1999-12-01
2  홍길남   21   nam@hong.com  서울시 강동구 1999-11-01
3  홍길북   22   buk@hong.com  서울시 관악구 1999-05-01
4  홍길중   23   mid@hong.com   부산시 중구 1999-01-30

In [46]:
# (4) sep='|', 상위5행만 읽어오기
member = pd.read_csv('data/ch11_membersep.csv',
                    sep='|',
                    nrows=5)
member

  Name  Age          Email  Address       Birth
0  홍길동   20  hong@hong.com  서울시 강동구  1999-01-01
1  홍길서   30   seo@hong.com   서울시 중구  1999-12-01
2  홍길남   21   nam@hong.com  서울시 강동구  1999-11-01
3  홍길북   22   buk@hong.com  서울시 관악구  1999-05-01
4  홍길중   23   mid@hong.com   부산시 중구  1999-01-30

## 2.4 패키지에서 가져오기: iris 데이터
- iris 가져오기 방법1: sklearn (머신러닝 패키지)
- iris 가져오기 방법2: statsmodels (R 데이터)  * 인터넷이 되어야만 이용 가능
- iris 가져오기 방법3: seaborn(시각화 패키지), * matplotlib이 1세대, seaborn이 2세대
### iris 가져오기 방법1: sklearn (머신러닝 패키지)

In [52]:
from sklearn import datasets
# sklearn: 머신러닝 패키지(전처리함수, 머신러닝, 성능평가를 위한 함수, 학습데이터셋)
iris = datasets.load_iris()
iris.keys() # 딕셔너리 형태

dict_keys(['data', 'target', 'frame', 'target_names', 'DESCR', 'feature_names', 'filename', 'data_module'])

In [53]:
print(iris.DESCR) # iris데이터 셋에 대한 설명

.. _iris_dataset:

Iris plants dataset
--------------------

**Data Set Characteristics:**

    :Number of Instances: 150 (50 in each of three classes)
    :Number of Attributes: 4 numeric, predictive attributes and the class
    :Attribute Information:
        - sepal length in cm
        - sepal width in cm
        - petal length in cm
        - petal width in cm
        - class:
                - Iris-Setosa
                - Iris-Versicolour
                - Iris-Virginica

    :Summary Statistics:

    ============== ==== ==== ======= ===== ====================
                    Min  Max   Mean    SD   Class Correlation
    ============== ==== ==== ======= ===== ====================
    sepal length:   4.3  7.9   5.84   0.83    0.7826
    sepal width:    2.0  4.4   3.05   0.43   -0.4194
    petal length:   1.0  6.9   3.76   1.76    0.9490  (high!)
    petal width:    0.1  2.5   1.20   0.76    0.9565  (high!)
    ============== ==== ==== ======= ===== ====================

    :Missing Attribute Values: None
    :Class Distribution: 33.3% for each of 3 classes.
    :Creator: R.A. Fisher
    :Donor: Michael Marshall (MARSHALL%PLU@io.arc.nasa.gov)
    :Date: July, 1988

The famous Iris database, first used by Sir R.A. Fisher. The dataset is taken
from Fisher's paper. Note that it's the same as in R, but not as in the UCI
Machine Learning Repository, which has two wrong data points.

This is perhaps the best known database to be found in the
pattern recognition literature.  Fisher's paper is a classic in the field and
is referenced frequently to this day.  (See Duda & Hart, for example.)  The
data set contains 3 classes of 50 instances each, where each class refers to a
type of iris plant.  One class is linearly separable from the other 2; the
latter are NOT linearly separable from each other.

.. topic:: References

   - Fisher, R.A. "The use of multiple measurements in taxonomic problems"
     Annual Eugenics, 7, Part II, 179-188 (1936); also in "Contributions to
     Mathematical Statistics" (John Wiley, NY, 1950).
   - Duda, R.O., & Hart, P.E. (1973) Pattern Classification and Scene Analysis.
     (Q327.D83) John Wiley & Sons.  ISBN 0-471-22361-1.  See page 218.
   - Dasarathy, B.V. (1980) "Nosing Around the Neighborhood: A New System
     Structure and Classification Rule for Recognition in Partially Exposed
     Environments".  IEEE Transactions on Pattern Analysis and Machine
     Intelligence, Vol. PAMI-2, No. 1, 67-71.
   - Gates, G.W. (1972) "The Reduced Nearest Neighbor Rule".  IEEE Transactions
     on Information Theory, May 1972, 431-433.
   - See also: 1988 MLC Proceedings, 54-64.  Cheeseman et al"s AUTOCLASS II
     conceptual clustering system finds 3 classes in the data.
   - Many, many more ...

In [54]:
iris.data # 독립변수
iris['data'][:3]

array([[5.1, 3.5, 1.4, 0.2],
       [4.9, 3. , 1.4, 0.2],
       [4.7, 3.2, 1.3, 0.2]])

In [55]:
iris.feature_names # 독립변수의 열이름
iris['feature_names']

['sepal length (cm)',
 'sepal width (cm)',
 'petal length (cm)',
 'petal width (cm)']

In [61]:
# 데이터 프레임에서 열이름
columns = [col[:-5].replace(' ','_') for col in iris.feature_names]+['species']
columns

['sepal_length', 'sepal_width', 'petal_length', 'petal_width', 'species']

In [63]:
# iris.target
iris['target'] # 머신러닝시 종속변수

array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
       2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
       2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2])

In [64]:
iris.target_names

array(['setosa', 'versicolor', 'virginica'], dtype='<U10')

In [65]:
# iris['target_names'][iris['target']]
iris.target_names[iris.target]

array(['setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
       'setosa', 'setosa', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'versicolor',
       'versicolor', 'versicolor', 'versicolor', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
       'virginica', 'virginica', 'virginica'], dtype='<U10')

In [66]:
# 독립변수
data = iris.data
# 종속변수
target = iris.target_names[iris.target]
data.shape, target.shape # 독립변수와 종속변수의 차원

((150, 4), (150,))

In [67]:
# 독립변수와 종속변수를 stack한 후 데이터프레임으로 구성
pd.DataFrame(data=np.hstack( (data, target.reshape(-1,1) ) ),
            columns=columns)

    sepal_length sepal_width petal_length petal_width    species
0            5.1         3.5          1.4         0.2     setosa
1            4.9         3.0          1.4         0.2     setosa
2            4.7         3.2          1.3         0.2     setosa
3            4.6         3.1          1.5         0.2     setosa
4            5.0         3.6          1.4         0.2     setosa
..           ...         ...          ...         ...        ...
145          6.7         3.0          5.2         2.3  virginica
146          6.3         2.5          5.0         1.9  virginica
147          6.5         3.0          5.2         2.0  virginica
148          6.2         3.4          5.4         2.3  virginica
149          5.9         3.0          5.1         1.8  virginica

[150 rows x 5 columns]

### iris 가져오기 방법2: statsmodels (R 데이터)  * 인터넷이 되어야만 이용 가능


### iris 가져오기 방법3: seaborn(시각화 패키지), * matplotlib이 1세대, seaborn이 2세대